[{"p1": "A cool-season vegetable​​,​ ​potatoes (Solanum tuberosum) offer organic gardeners everything they could want ​– easy to grow​, long storage life and an enormous selection of varieties. ​They’re also a good source of fiber and a ​powerhouse of nutrition. ​Potatoes contain vitamins A and B; minerals like iron, zinc, potassium, magnesium, and calcium; and several antioxidants.", "p2": "Their only downside is that ​store bought potatoes carry more pesticides than most vegetables​. ​They get sprayed with all kinds of nasty fungicides, herbicides and pesticides, even before they’re planted, and then they get sprayed again. Worse the chemical residues tend to be absorbed in the skin and flesh. So what can you do. Why not grow organic potatoes at home? It’s not hard and you’ll know the spuds you feed your family are safe to eat — just the way they should be!", "site_preparation": {"p1": "Potatoes require sandy, fertile, fast-draining soil. The tubers will become deformed in poor or rocky soil. Keep the soil moist but not soggy, and do not allow it to dry out. Water deeply as temperatures begin to rise. They require moderate levels of nitrogen (N), phosphorus (P), potassium (K), calcium and sulfur. Prior to planting, mix plenty of organic compost into your garden plot.", "p2": "Tip:Spuds are a favorite food of gophers. To prevent damage and destruction, plant spuds above ground in ourGeobin® Composter."}, "howPlant": {"p1": "Plant potatoes in early spring for a summer crop, in late summer or early fall for a winter/spring crop in mild winter regions. Set tuber pieces 2 inches deep, 1-1/2 feet apart.", "p2": "Add loose soil as the plant grows, taking care not to cover stems completely. Mulching with straw reduces pest problems and improves yields.", "p3": "Several serious potato diseases are spread from infected tubers. Only purchase seed that is certified disease-free.", "p4": "DoNOTplant tubers purchased from the supermarket. In most cases, they will be treated with a chemical sprout inhibitor."}, "quick_guide": ["1. Plant early in spring using certified disease-free tubers", "2. Needs full sun and loose, nutrient-rich soil that’s free of rocks", "3. Add soil to the base of the plant throughout the summer season", "4. Harvest new potatoes when flowers open; tubers are mature when tops die", "5. Pests and diseases include Colorado potato beetle, aphids, cutworm, flea beetles, wireworms, black heart, common scab, late blight, and gophers"], "storage": {"p1": "Harvest new potatoes when flowers begin to open. Pull aside earth around the base of the plants, and gently pick tubers. As soon as tops die down (90-120 days, depending on variety and climate), spuds are ready to harvest. If weather is not too warm or wet, tubers will keep in the ground for several weeks. Dig them up before the first frost.", "p2": "After curing, store the tubers in a cool, dry place such as the cellar. Storage is easy for the first couple of months. After that, check often for spoilage. DoNOTkeep in a plastic bag and use nicked or bruised root crops first."}, "diseases": {"p1": "TheColorado potato beetleis a common insect pest of potatoes. Symptoms include skeletonized leaves and defoliated plants. Other pests includeaphids,cutworm,flea beetlesandwireworms.", "p2": "Spinosad, the active ingredient inMonterey® Garden Insect Spray, is a relatively new biological pest control that can be effectively used to combat potato bugs. Mix 4 Tbsp per gallon of water and apply to both upper and lower surfaces of plant foliage.", "p3": "Common diseases includeblack heart(streaks inside tubers),common scab(russet skin),earlyandlate blight(dark spots on leaves), andmosaic virus(mottled light and dark green leaves)."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-potatoes1.jpg"}, {"p1": "Fresh sliced, canned or made into sauces, what could be better than​ ​a​ ​homegrown, organic​ ​tomato?​ ​The rich, sun-kissed taste of these juicy fruits makes growing tomatoes​ ​(Solanum lycopersicum​) ​​the Holy Grail of backyard gardeners everywhere!​ ​Start a number of varieties indoors up to two months before last frost. Once in the garden give them plenty of​ ​compost​ ​and keep them watered. Some cherry varieties, like candy on​ ​the vine, are ready in two months or more after transplanting; bigger varieties can take up to three months before harvest.", "p2": "Tomatoes are not just good, they’re also good for you. Fruits are a rich source of antioxidants and contain many amazing health benefits. They offer super-sized amounts of vitamins A, C and K, as well as a host of other vitamins and minerals, including folic acid, potassium, iron and calcium. In other words, keep eating (and growing) them.", "site_preparation": {"p1": "Tomato plants are very deep rooted and don’t need nearly as much water as most people believe. They will do much better in garden soil than in pots and require plenty of sun.", "p2": "Plant after the soil has warmed in the spring in rich, fast-draining soil which has been amended with ample amounts ofgarden compost, well-rotted animal manure andorganic calciumto prevent blossom end rot.", "p3": "Tip:Tomatoes are one of the few crops that can be grown in the same location for years. Studies have shown that they prefer to grow in compost made of their own foliage."}, "howPlant": {"p1": "Most home gardeners buy seedlings or start their own seeds indoors about 5-8 weeks before the last frost date. Tomato plants love warm days and nights, so make sure you don’t plant out too early.", "p2": "Allow enough space (1-1/2 – 3 feet) between plants to permit good sun penetration and air circulation. Plant tomatoes deep in the soil, up to the first set of leaves or deeper. Roots will form all along the stem. Water deeply for long periods of time once or twice a week to encourage roots to reach down into the soil. Once the plants are established, start them on a biweekly fertilizer program.", "p3": "Tip:In northern climates useWall O’ Watersto protect transplants from frost and speed production.Support", "p4": "Tomatoes need support to keep the fruit off the ground. Cages will work without additional ties as they start. But be warned — they will often outgrow their cages in just a few weeks! At that time, use bamboo poles or tree stakes and tie the plants with twine or covered wire (seePlant Supports & Twine). Place the twine around a main stem and pull it gently toward the stake. Secure the twine to the stake.", "p5": "Pruning off young suckers between the main stem and leaf axils encourages higher yields and earlier fruiting on staked plants. When the vines reach the tops of the stakes, pinch back the tip."}, "quick_guide": ["1. The hardest part of  tomato gardening is choosing a variety, like cherry, beefsteak, heirloom, Roma, etc.", "2. Prepare soil be adding plenty of organic matter, but don’t overload with nitrogen", "3. For best production, start seeds indoors 5-6 weeks before the last frost.", "4. Plant seedlings deeply into well-prepared soil in full sun; water deeply a couple of times a week", "5. Harvest when fruits pull off the vine easily — green fruits can ripen indoors if frost hits", "6. See below for the list of pests and diseases"], "storage": {"p1": "Once tomato plants start ripening, check vines daily. Cut or gently twist off fruits, supporting the vine at the same time. For best flavor, leave the fruits on the plants for as long as possible. At first sign of heavy frost, harvest all fruits. Green ones will eventually ripen while stored in a warm place out of direct sunlight. Tomatoes require 90-140 days to mature from seed; 60-90 days from transplanting, depending on the variety.", "p2": "Contrary to our common practice, storing tomatoes in a refrigerator is not recommended, as the cooler temperatures can cause them to lose flavor and get mushy."}, "diseases": {"p1": "There are numerousinsect and disease problemsassociated with tomatoes (too many to mention here). We have listed two of the more common problems:", "p2": "Tomato HornwormHornworms are impressive caterpillars that are very easy to control. They are identified by their impressive size (3-6 inches) and the spiked horn at the tail, but their green color makes them difficult to spot among the foliage.", "p3": "To findtomato hornworms, simply follow the trail of chewed foliage. Then, look for their scat on the leaves. To control them, usediatomaceous earthas a dusting powder, hand pick them, or usebacillus thuringiensisas a spray for control. Although these are all organic remedies, please use safety gear when applying any pesticide.", "p4": "Blossom End RotBlossom end rot is a tomato disease usually caused by a calcium deficiency in the soil, although it is sometimes brought on by drought, high salt levels, excess nitrogen or uneven soil moisture. It is identified by a brown mushy spot on the butt end of the fruit. Preventblossom end rotby keeping soil evenly moist and by spraying plants withkelp extractorliquid calciumas a foliar treatment.", "p5": "Note:Containing 14% phosphate and up to 24% calcium,organic bone mealpromotes healthy fruit development."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/vine-ripe-tomatoes.jpg"}, {"p1": "", "p2": "Learning how to grow onions isn’t difficult. Easy to cultivate with a long storage life, backyard gardeners are growing onions (Allium cepa) successfully in most areas of the United States.", "site_preparation": {"p1": "Onions grow best in full sun and deep, fertile, well-drained soil with plenty of organic matter.", "p2": "Work in a generous amount of organic compost or well-aged animal manure prior to planting. All varieties are shallow rooted and need constant moisture near the surface.", "p3": "Bulbs form in response to day length. If you choose a type inappropriate for your area, it may make small, premature bulbs or no bulb at all.", "p4": "Long-day onions, Sweet Spanish included, need 14-16 hours of daylight and are grown in northern climates.", "p5": "Short-day onions, Bermuda included, need 10-12 hours of daylight. These start making bulbs early in the year. Select anonion typethat is suited to your zone for best results."}, "howPlant": {"p1": "Starting from seed is often the only way to get classic, gourmet varieties. Sow indoors up to twelve weeks ahead of outdoor transplanting.", "p2": "Set out two weeks before the last frost date. You can also purchase onion sets from nurseries and local garden centers. Sets are easy to start and mature quickly, but varieties are often limited.", "p3": "When planting onions allow 2-4 inches between seedlings in traditional rows spaced 1-2 feet apart. Add a layer of mulch and weed thoroughly.", "p4": "Feed young plants with a high-qualityorganic vegetable fertilizerand applyLiquid Fish & Seaweedlater in the season to improve crop yields, taste, and appearance."}, "quick_guide": ["1. Choose a variety suited to day length in your areas (see above)", "2. Direct seed or plant sets", "3. Plant into well-prepared soil in full sun", "4. Keep well watered, fertilize regularly", "5. Harvest by pulling bulbs and drying them for 2 weeks", "6. Common pests and diseases are thrips, wireworms, botrytis rot and downy mildew"], "storage": {"p1": "Onions are ready to harvest when the tops fall over naturally, usually 80-100 days after direct seeding; 30-40 days from onion sets.", "p2": "Spring-planted onions are usually ready to harvest by mid-summer.", "p3": "When onions reach maturity, their tops turn yellow and begin to fall over. Bend the tops down or even stomp on the foliage at this point to hasten the final ripening process.", "p4": "Loosen the soil around the bulbs to promote drying. In dry weather, harvest onions by late summer. Wet onions do not cure well and may rot in storage.", "p5": "Pull bulbs from the ground and let them air-cure for two weeks. Watering prior to harvest makes pulling easier.", "p6": "After curing, store the bulbs in a cool, dry place such as the cellar. DoNOTkeep them in a plastic bag."}, "diseases": {"p1": "To preventinsect and disease problemsrotate crops and avoid planting onions in the same area for three years.Thripsare suspected if the bluish-green leaves become bleached and wither.", "p2": "Damage to the lower portion of the stem is often caused by onion maggots.Wireworms(the larvae of click beetles) can also cause serious damage as they feed on all underground parts.", "p3": "Note:Monterey® Take Down Garden Spraycombines the fast knockdown of pyrethrin and the residual activity of canola oil to killALLstages of insects, including eggs. Best of all, it breaks down quickly in the environment and may be used on edible crops up to and including the day of harvest.", "p4": "Common diseases includebotrytis rotanddowny mildew, both of which are characterized by soft tissue and mold."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-onions1.jpg"}, {"p1": "Native to North and South America, corn — or maize — was first cultivated some 4,000 years before Columbus set foot in the New World. Today, with more than 85% of the US crop genetically modified, it is more important than ever for backyard gardeners to start growing corn at home and preserve the good, old fashioned heirloom varieties that so many generations have enjoyed eating right off the cob.", "p2": "Heirloom corn varieties have been passed down from generation to generation, are GMO-free and are cherished for their outstanding characteristics, such as superior taste, adaptability and vigorous growth.", "site_preparation": {"p1": "Corn is a warm-season vegetable that requires full sun, ample water and deep, rich garden soil to perform well. Warmer temperatures at night also accelerate growth. Prepare the planting site by working in generous amounts of a quality organic compost orwell aged animal manure. Plants need to be well protected from frost.", "p2": "Tip:Cover the planting area with black plastic for two to four weeks prior to planting to warm the soil and improve germination. Corn will not germinate if soil temperatures are below 55˚F."}, "howPlant": {"p1": "Corn should beplanted directly into the soilafter it has warmed in the spring (two weeks after your average last-frost date). Sow seeds 1 inch deep, 8-12 inches apart. Crops are wind-pollinated, so plant in short rows or blocks to ensure even pollination. Undeveloped kernels indicate uneven pollination. Plant a new crop every two weeks to ensure harvest throughout the gardening season.", "p2": "Plants are heavy feeders. Fertilize withalfalfa meal,blood mealor otherhigh nitrogen organic fertilizeruntil tassels develop.", "p3": "Tip:Some gardeners in colder climates have had luck starting seeds in individual pots (newspaper,biodegradable pots, etc.) that they plant directly into the ground.", "p4": "Consider addingkelp mealto vegetable gardens. It’s loaded with micronutrients and is especially good for supplying trace minerals to crops that will be consumed. It will also help guard against plant stresses such as insects, frost, disease and drought.", "p5": "Make sure that the entire root zone is damp as ears mature by watering at the base of the stalks. Soaking the leaves rather than the roots washes away pollen and reduces the number of kernels that develop."}, "quick_guide": ["1. Direct seed into warm soil located in full sun", "2. Corn is a heavy feeder, so prepare the planting area with plenty of organic matter", "3. Water faithfully", "4. Protect against wildlife like raccoon and deer", "5. Harvest 65-90 days after planting", "6. Pests and diseases include earworm and smut"], "storage": {"p1": "Corn isready to pickthree weeks after tassels appear. Look for dark green husks, brown supple silks and plump kernels that squirt “milky” liquid when pinched. Ears taste best when picked in the late afternoon and should be twisted from the plant in a downward motion. Sweet corn requires 65-90 days to reach maturity, depending on the variety.", "p2": "Store in plastic bags in the refrigerator. For best flavor, use within two days of picking and can remaining crop shortly after harvest."}, "diseases": {"p1": "Rotate corn with other crops to prevent recurring pest or disease problems.Corn earworm,deerand raccoon are common problems. Discourageanimal pestswith fencing,repellentsandscare devices.", "p2": "Spinosad is a relatively new biological pesticide that can be used to effectively combat earworms. Mix 4 Tbsp. per gallon of water and treat silk frequently. Approved for organic use, spinosad — the active ingredient inMonterey® Garden Insect Spray— does not significantly impact beneficial insects and spiders while controlling pests.", "p3": "White or grayish swellings are signs ofcorn smut, a common fungal disease that should be treated withorganic fungicides."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-corn1.jpg"}, {"p1": "Peppers are the second most popular vegetable to grow in backyard gardens (yes, tomatoes are #1), and it’s no mystery why… They are prolific producers, come in all shapes, colors and sizes and range in taste from sweet to downright fiery. Peppers, including ornamental varieties, are members of the Solanaceae family (nightshades), which makes them related to potatoes, eggplant and tomato plants.", "p2": "All pepper plants prefer​ ​plenty​ ​of sunshine and long seasons.​ ​Try raising several types​ ​(there are hundreds)​ ​at home to find just the right​ ​varieties​ ​for your ​taste and ​climate.​ And the peace of mind you’ll gain from growing peppers from seeds without chemicals? Priceless!", "site_preparation": {"p1": "Most pepper varieties are annuals, lasting only one season. They require full sun, fast-draining soil and regular water. Plants grow best when temperatures are warm and need substantial heat to set fruit. They tolerate drought, but do best in soil that is evenly moist but not soggy. Prior to planting, mix plenty of well rotted animal manure or organic compost into your pepper patch.", "p2": "Crops are productive in moist — not wet — soils. Drip irrigation orsoaker hosescan be used to direct water right to the plants’ roots. This will also keep the leaves dry, which helps prevent manydisease problems."}, "howPlant": {"p1": "Start pepper seedsindoors 6-8 weeks before the last frost or — depending on your climate zone —sow seeds directly in the gardenafter the soil has warmed. Nighttime temperatures must remain above 55˚F. In traditional rows, space plants 1-1/2 feet apart. Or plant in raised beds keeping them 1-1/2 feet apart in all directions. Provide support for taller varieties more than one foot tall.", "p2": "Apply a goodorganic vegetable fertilizeronce or twice after the plants become established, before blossoms set. Side-dressings ofgreensandcan help offset potassium deficiency, andorganic bone mealcan supply needed phosphorus and calcium.", "p3": "Tip:In northern climates useWall O’ Watersto protect transplants from frost and speed production."}, "quick_guide": ["1. Start seed inside 6-8 weeks before the last frost or get seedlings from your favorite garden center", "2. Plant into compost-rich soil in full sun", "3. Thrive during hot days and warm nights", "4. Need consistent fertilizer and watering", "5. To harvest, cut fruit from plants", "6. Pests and diseases include aphids, cutworm, leafminer, flea beetles, anthracnose, bacterial spot, mosaic and blossom end rot"], "storage": {"p1": "Harvest peppers early and often – the more you pick, the more they will produce. Most varieties can be eaten when they are green and under-ripe, although the flavor improves as they mature. Always cut (don’t pull) fruits from the plant. Allow 65 to 80 days from transplant to harvest.", "p2": "Store fresh peppers in a ventilated plastic bag and keep in the produce bin of your refrigerator for 1-2 weeks. May also be sliced thin and frozen or dried.", "p3": "Tip:Once the fruit has set and colored, you can bring peppers indoors as ornamental plants. They look quite festive for the holiday season. Don’t expect them to last too long indoors, however."}, "diseases": {"p1": "Peppers are susceptible to many insect pests, includingaphids,cutworm,leafminerandflea beetles, which chew many tiny holes in the leaves of your plants. Common diseases includeanthracnose,bacterial spot,mosaicandblossom end rot."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-peppers1.jpg"}, {"p1": "This annual warm-season vegetable is available in an array of attractive varieties, some of which don’t resemble pumpkins​ ​at all. They also dish up some powerful nutritional perks like vitamins A, E and C, along with minerals like phosphorous, calcium and potassium. A member of the Cucurbitaceae family, the pumpkin (Cucurbita maxima) is closely related to squash, melons and gourds.", "p2": "​The jolliest of fall crops, pumpkins are great for jack-o-lanterns and, of course pies! Grow them like squash and give those trailing vines plenty of room to roam​. Heck, why not plant some of the giant varieties and claim bragging rights with your neighbors.", "site_preparation": {"p1": "Pumpkins require full sun, ample water and plenty of room to sprawl. Choose a site that is protected from cool winds and work in large amounts ofgarden compostandwell-aged chicken manure. The soil should be tilled deep and over a large area – roots and vines can wander for 15 feet (or more!) in any direction. Old compost piles make great patches."}, "howPlant": {"p1": "Start pumpkins indoors from seed or nursery stock.Harden plants offandtransplant outsidewhen the soil is truly warm in the spring. Fertilize regularly with abalanced organic product, but try to keep the leaves dry in order to prevent fungus disease. The entire root system should be kept moist at all times.", "p2": "Once flowers begin to develop,hand pollinatefemale flowers (those with a bulb-like growth attached directly to the main stem) with a male flower (those with a slender stem). Pick a male flower, then touch it gently onto the female flower to ensure pollination.", "p3": "Continue to provide ample water during the season. As temperatures warm, mulch the garden area with compost, leaves or straw to prevent weeds and conserve moisture.", "p4": "Tip:If you want togrow a giant pumpkin, allow only the first two flowers on a vine to become pollinated, then pinch off all the other flowers so that there is only one or two fruits per vine."}, "quick_guide": ["1. Start seeds indoors or purchase seedlings from a local garden center", "2. Plant after frost danger has past — squash love heat", "3. Choose full sun and compost-rich soil", "4. Water regularly and add mulch to retain moisture", "5. Good air circulation (breezes) are essential to prevent mildew and fungus", "6. Harvest when fruit has a deep, rich color and foliage has died back", "7. Pests and diseases include bacterial wilt, powdery mildew, downy mildew, and anthracnose"], "storage": {"p1": "Pumpkins are ready to harvest when they have a deep solid color and the vines die back and turn brown. Usefloating row coverduring a light frost and avoid leaving fruits out during a hard freeze to prevent softening. Allow 110-120 days to reach maturity.", "p2": "Wipe soil from pumpkins and store clean in a cool, dry area with good ventilation. They last longer when placed on pieces of cardboard or wooden shelves. DoNOTplace directly on concrete floors. Freeze the flesh after cooking."}, "diseases": {"p1": "Common insect pests that attack pumpkin include;cucumber beetles,squash vine borersandsquash bugs. Applyorganic pesticidesto establish control. Remove crop debris and rototill the garden after harvest to prevent future problems.", "p2": "Bacterial wilt(spread by cucumber beetles),powdery mildew,downy mildewandanthracnoseare common plant diseases. Choose a site with good air circulation to prevent many fungal problems and applyorganic fungicides(copper, sulfur) early, when symptoms first appear."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-pumpkins1.jpg"}, {"p1": "Native to the Mediterranean, globe artichokes (Cynara scolymus) require cool nights and warm days. Aside from providing delicious, unique finger food for the table, the plants themselves are beautiful! Artichokes grow up to 5 feet across and almost as high with beautiful silvery-green foliage and fragrant purple thistles.", "p2": "The amazing artichoke offers a superb nutty flavor with several health benefits. Tender globes are packed with vitamins C and K, minerals and dietary fiber. Artichokes are on the USDA’s list of top antioxidant foods and are known for their cancer-fighting properties.", "site_preparation": {"p1": "Each spring, mixorganic compostorpure forest humusinto your garden plot (seeHow to Prepare Garden Soil for Planting). Artichokes require sandy, fast-draining soil and cool temperatures to thrive. They need regular water for an ample harvest, but if you just like the look of the plant and don’t want to eat these tender thistles, they will survive on very little water. Artichokes are susceptible to freezing and do best where the temperature remains constant year round."}, "howPlant": {"p1": "For best production, sow artichoke seeds in the spring after frost danger is past, but before temperatures go above 50°F. Ideally, the seeds or seedlings should stay in this range for about 2 weeks. This special treatment encourages plants to produce more buds. After this stage, their ideal temperature range is between 55°F and 75°F.", "p2": "Plant globe artichokes in a location with full sun from bare root stock in January or from container grown stock later in the spring. To cultivate artichokes in cold winter climates, protect the root with several inches of straw mulch. Expert cold-weather gardeners go one better and grow them outdoors in large containers, and then move them to a protected location when the temperature drops. Fertilize (after you see greenery) with a small amount ofall-purpose fish fertilizer. Micronutrients fromseaweed extractare also beneficial."}, "quick_guide": ["1. Plant in quality soil that drains well", "2. Damp weather, with cool summer temperatures are best", "3. Fertilize early in the season; water regularly", "4. Pests include earwigs, aphids and slugs", "5. To harvest, cut fruit from plants"], "storage": {"p1": "Artichokes are ready to harvest when the edible flower buds are closed tightly and squeak slightly when squeezed. If you wait for them to open, they will be too tough to eat. Search the interior of the plant when picking because the chokes hide in the foliage. Small buds can be eaten whole without removing the fuzzy choke center.", "p2": "Artichokes take at least 110-150 days to reach maturity, if planting from seed and 100 days from divisions. Most do not flower until the second year of growth.", "p3": "Once the harvest is over, cut the plants back to 1-2 inches off the ground to try for a second harvest. New sprouts will form at the base of the plant. At the end of the season, allow the plant to dry out after the leaves begin to turn yellow. Once the foliage has died down and dried, remove it from the plant and put down a layer of organic compost to enrich the soil for next years crop.", "p4": "For best flavor, pick in the early morning, rinse and eat fresh. Artichokes can be stored in the produce drawer of your refrigerator for up to 2 weeks."}, "diseases": {"p1": "Protection fromearwigsis absolutely crucial. Also, keep an eye out foraphids,armyworms,slugs and snails. Useorganic diatomaceous earthor other natural pest control method, if present."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/fresh-artichokes.jpg"}, {"p1": "“The day is coming when a single carrot, freshly observed, will set off a revolution.” — Paul Cezanne", "p2": "Perfect for backyard vegetable gardens! Growing carrots at home is easy and can provide color, flavor and nutrition to an organic gardener’s diet. This popular root vegetable performs best in cool temperatures (between 60-70˚F) and may be planted as soon as your soil can be worked in early spring. Heirloom varieties are sweet, crisp and tender — ready to eat in about 70 days.", "site_preparation": {"p1": "Select a garden site in full sun or very light partial shade andprepare the soilwith ample amounts of organic compost. Carrots will reach perfection only when planted in deep, good-textured soil that is free of stones and debris. Grow the long varieties only if you can provide this type of soil. Choose shorter varieties if your soil is heavy or stony.", "p2": "Note:Soil loaded with nitrogen may produce more foliage than root, so make sure soil is balanced before you plant."}, "howPlant": {"p1": "Sow carrot seed in early spring 2 weeks before your last frost date — or in fall 10 weeks before your first frost date. Sow seeds thickly in rows 1 foot apart or broadcast seeds in 1 to 1-1/2 inch wide raised beds. When tops are 1 to 2 inches high, thin individual plants to 1 to 2 inches apart. Thin again when they begin to crowd. Cover crowns that push through the soil with a layer of mulch to prevent tops from becoming green or bitter. Carrots benefit from applications ofcompost teafrom emergence until the tops are 5 to 8 inches high.", "p2": "Like all root crops, carrots require plenty ofnatural fertilizerrich in potassium. Excessive nitrogen or uneven soil moisture will cause forking and split roots.", "p3": "Tip:Super Greensandis an organic soil amendment of the highest quality. Use it to supply potassium, an essential nutrient that promotes overall plant hardiness and disease resistance, along with iron, magnesium, silica and as many as 30 other trace minerals. Greensand may also be used to loosen heavy clay soils."}, "quick_guide": ["1. Start your garden in the spring by planting carrots 2 weeks before last frost", "2. Needs well-worked, balanced soil for best root development", "3. Direct seed only, and for best germination, keep seeds moist", "4. Eat fresh, freeze or store in the refrigerator or root cellar", "5. Pest and diseases include carrot rust fly, nematodes, birds, snails, and slugs"], "storage": {"p1": "Allow 50 to 85 days from seed to maturity. Harvest at finger size for best texture and flavor, and to make harvesting easier, water before you pull them up. Extend the storage life of carrots by cutting off all but 1 inch of the leaves and stem. Place in a container of water and keep in the refrigerator. To store overwinter, pack in damp sawdust and keep cool."}, "diseases": {"p1": "To prevent problems with diseases and insects, doNOTplant where carrots or parsley have grown for three years (seeCrop Rotation In the Home Garden). Rotted or dwarfed plants may be due to thecarrot rust fly. The maggots of this fly are often found chewing on the roots. If your plants are stunted and the leaves are yellow, suspectnematodes. Unlike beneficial nematodes, these microscopic pests attack the roots of the plant causing galls (swelling) to develop. Protect emerging seedlings from birds,snails and slugs. If seedlings topple over, suspect damping off. Check for watery soft rot on the stem at the soil line.", "p2": "Tip:One of the easiest methods to protect garden crops from flying insects is thefloating row cover. Simply cover loosely over seed beds to allow plenty of slack for plant growth. Garden staples or rocks can be used to secure the fabric to the ground."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/growing-carrot.jpg"}, {"p1": "There are many reasons that garlic (Allium sativum), a prominent member of the onion family, has been cultivated for thousands of years. Today’s gardeners know that growing garlic bulbs is ridiculously easy, takes up little room and provides an essential flavor for many dishes.", "p2": "Garlic is valued for its zesty kick and many health-boosting benefits. Research has shown that it can reduce the risk of heart disease by lowering LDL cholesterol levels and high blood pressure. Many Italian grandmothers have relied on it for generations to knock back colds, too.", "site_preparation": {"p1": "Each spring, work plenty oforganic compostor well-rotted animal manure deeply into your planting area. Garlic thrives in all zones and grows very well in raised beds, except in very dry areas. It requires full sun and sandy, fast-draining soil full of organic matter. Regular watering during the gardening season is recommended for optimal bulb development."}, "howPlant": {"p1": "The best time to plant is mid-autumn (seeFall is Garlic Planting Time). When planting, break the bulbs apart into individual cloves and, with the papery husks on, poke the cloves into the ground with the pointed end up (root end down) 1 inch deep in rows 1 foot apart. Top the soil with 4 to 6 inches of mulch to help maintain soil moisture and limit weeds. Fertilize by spraying leaves every two weeks withfish and kelp fertilizeror side dress with a goodorganic bulb food.", "p2": "Mulching fall garlic is important.Five inches or more is not too much. The mulch may not prevent some ground freezing but it will help prevent frost heaves that will displace your carefully placed bulbs.", "p3": "Tip:If you want to produce large bulbs, plant only large cloves."}, "quick_guide": ["1. Choose large, blemish-free bulbs", "2. Plant in sandy, compost-rich soil in full sun", "3. Mulch heavily; water and fertilize regularly", "4. For best harvest, plant in fall and harvest the following summer", "5. Very few pests aside from onion maggot larva"], "storage": {"p1": "Harvest garlic using a spading fork when the leafy tops fall over, usually in June or July, depending on your location. Air-dry the bulbs by tying plants together in bundles of 6 to 10 and hanging them to cure for about four to six weeks. When completely dry, remove the tops and the roots and store in a cool dry area. Spring-planted cloves requires 120-150 days to reach maturity. However, the best quality and yields are from fall-planted cloves.", "p2": "Looking for a tasty treat? Every gourmand worth her designer sea salt is usinggarlic scapesto flavor dishes ahead of the harvest."}, "diseases": {"p1": "Very few pests bother with garlic, but occasionally, theonion maggot larvacan be seen in cloves at harvest time. The typical symptom is premature dying of the leaf tips."}, "img": "https://www.planetnatural.com/wp-content/uploads/2012/12/garlic-bulbs.jpg"}]