{"Cucumber": {"water": "cucumber requires consistent watering - ideally, it should be given at least 2.5 cm of water per week, and usually more during the summer when temperatures are high and soil dries out faster. Though you should take care not to waterlog it, the soil around the cucumber should be kept from drying out. In spring and fall, when growth is slower, you can taper your watering slightly.", "fertilization": "encourage flower and fruit growth, cucumber should be given a fertilizer that's low in nitrogen (which encourages stem and leaf growth) but high in phosphorus and potassium; a 3-6-4 or 5-10-10 mix usually works fine. Fertilizer, either powder or liquid, can be applied often – give some during planting, after flowering, and then every three weeks while the plants are fruiting.", "soil": "Sand, Clay, Acidic", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Spring "}, "Eggplant": {"water": "key to keeping Eggplant happy is to ensure the soil is consistently moist. Water the plant regularly, but not excessively, especially when it is young since this allows it to form a long and healthy root system. Water the soil, not the plant, and keep it moist with a layer of mulch.", "fertilization": "the soil around an eggplant is a great way to introduce nutrients. The best time to do this is a week or two after planting. The plant can also benefit from the addition of an all-purpose granular fertilizer.", "soil": "Loam, Neutral", "sunlight": "sun, Partial sun", "plantingTime": " Early spring "}, "Garden onion": {"water": "is sensitive to water requirements. You need to water them every week using a sprinkler or a hose. Alternatively, you can irrigate to a depth of 2.5 inches. Plus, make sure the soil is well-draining and does not make the roots soggy.", "fertilization": "requires high levels of nitrogen in the soil. It usually becomes crucial to provide them with fertilizer with a high concentration of nitrogen. You should add more fertilizer during the first two to three weeks of planting.", "soil": "Clay, Neutral, Alkaline", "sunlight": " Full sun ", "hardinessZones": "     4 to 11    "}, "Potato": {"water": "requires even moisture throughout its growing stages, which is particularly important during its early tuber and vine growth stages. When the soil becomes dry, give the plants about 1 to 2 inches of water. Once the vines and foliage start to die back, watering is no longer required.", "fertilization": "will do well with the addition of low-nitrogen fertilizer. It responds well to both natural mulches and commercial fertilizers, just do not apply it in direct contact with the seeds. Typically, fertilizer is applied right after planting and halfway through the growing season, when plants are around 10 to 15 cm tall.", "soil": "Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 10", "plantingTime": " Spring "}, "Cabbage": {"water": "keep the soil moist but do not let water accumulate.", "fertilization": "once in spring.", "sunlight": "sun, Partial sun", "plantingTime": " Spring, Fall "}, "Cauliflower": {"water": "keep the soil moist but do not let water accumulate.", "fertilization": "planting, make sure your cauliflower has a bed full of rich organic compost and manure to grow into. Cauliflower is a heavy feeder and will enjoy a dose of organic liquid fertilizer once a week. For an extra boost, apply a balanced veggie fertilizer once a month.", "sunlight": "sun, Partial sun", "hardinessZones": "     8 to 11    ", "plantingTime": " Spring, Summer "}, "Kohlrabi": {"water": "keep the soil moist but do not let water accumulate.", "fertilization": "right fertilizer can help the kohlrabi produce a greater harvest and grow stronger. The best fertilizer to use is an organic variety, such as compost, that can provide the most effective nutrients when mixed in with the soil. Apply the fertilizer once a year, either in the spring or in the autumn.", "soil": "acidic", "sunlight": " Full sun ", "hardinessZones": "     4 to 9    ", "plantingTime": " Spring, Fall "}, "Turnip rape": {}, "Brussel sprouts": {}, "Bok choy": {}, "Cayenne pepper": {"water": "need regular and frequent watering throughout their entire growth cycle. The best way to keep them well-watered is by using drip irrigation. If you're growing them in containers, water thoroughly when a top few inches of soil becomes dry. Make sure the soil does not become waterlogged by providing good drainage.", "fertilization": "feeding your peppers upon planting. Apply well-rotted manure or garden compost in the spring and continue feeding your peppers with balanced, all-purpose fertilizer during the growing season. For any additional feeding, test your soil to check for nutrient deficiencies.", "soil": "Loam, Clay, Acidic, Neutral, Alkaline", "sunlight": " Full sun ", "hardinessZones": "     7 to 11    ", "plantingTime": " Spring "}, "Field pumpkin": {"water": "pumpkin is a thirsty plant that will require at least one inch of water per week, often more as they are fruiting. The leaves of these plants are sensitive to rot and disease, so you should try to keep them dry even while watering - spread your water in a circle around the base of the plant instead.", "fertilization": "pumpkin does well in rich soil and usually responds best to multiple fertilizer feedings per year. When the plant is first growing, you can use a nitrogen-heavy mix (e.g., 10-5-5) to encourage vigorous leaf and stem growth. Once flowering and fuiting occurs, however, you'll want to switch over to a potassium- and phosphorus-heavy mix (e.g., 10-20-20) to encourage a large, healthy crop. Liquid, granulated, or powder fertilizers are all fine, so long as they're not applied directly to the plant (which can cause nitrogen burns).", "soil": "Clay, Sand, Chalky, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Late winter "}, "Beet": {"water": "like to be watered frequently but are susceptible to crop failure and disease if over watered. As a rough guideline, Beet should receive around 2.5cm of water a week which can be obtained from rainwater or from your own application. Maintain moist soil throughout.", "fertilization": "likes nitrogen-rich soil, so a layer of grass clippings can be put over the soil from time to time. When sowing the seeds of beet, make sure all-purpose fertilizer has been mixed into the soil. The balance of the fertilizer depends on the ph of the soil.", "soil": "Loam, Clay, Chalky, Sandy loam, Moderately acidic, Slightly acidic", "sunlight": "sun, Partial sun", "hardinessZones": "     2 to 11    "}, "Common bean": {"water": "Common bean is a very thirsty plant, especially when developing flowers and fruits. As long as the soil has good drainage, they can be watered daily. As moisture on leaves and stems may cause rot or disease, try to water the soil around the plant's stalk 鈥?or, water when the sun is out so that any surface moisture will dry out quickly.", "fertilization": "bean is a nitrogen-fixing plant that usually require little, if any, soil amendments. A layer of compost, applied in early spring, can help ensure your plants are getting all the micronutrients they need, however. If your soil is highly phosphorus deficient, applying a low-nitrogen fertilizer mix (e.g., a 5-10-10 ratio mix) or bonemeal may be appropriate.", "soil": "Clay, Sand, Sandy loam, Acidic, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Spring, Summer "}, "Winter squash": {"water": "should water the soil around the winter squash graciously. Do not let the soil dry out as it should be maintained evenly moist and do not water its leaves as this may encourage bacteria.", "fertilization": "squash should be fertilized well with fertilizers such as manure and liquid seaweed dispursed in its soil. These nutrient-loving plants should be fed every two to three weeks to encourage fruits and flowers.", "soil": "Clay, Neutral", "hardinessZones": "     5 to 11    ", "plantingTime": " Spring, Summer "}, "Sweetpotato": {"water": "Sweetpotato enough to keep the soil moist but not waterlogged. On average, this will be about once a week. The plant's leaves will droop when it is thirsty, but try to catch the problem before that by checking the soil surface for dryness every few days.", "fertilization": "sweet potato vine weekly with a balanced fertilizer during the growing period to boost growth. If you wish to encourage flowering, then a low nitrogen fertilizer (such as 7-9-5) will work well. Stop all fertilizer in late fall and winter.", "soil": "Sand, Chalky, Clay, Sandy loam, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     8 to 12    ", "plantingTime": " Spring, Summer "}, "Coriander": {"water": "prefers damp, moist soil. However, it will suffer if overwatered. Dry soil will result in the plants bolting, so care must be taken to maintain the moisture balance. Seedlings will require a little more water each week, approximately 2.5cm.", "fertilization": "does not need to be fed frequently. A small diluted application of balanced liquid fertilizer or nitrogen rich fertilizer is all that is required once or twice during the growing season.", "soil": "Sand, Chalky, Clay, Sandy loam, Acidic", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Spring, Fall, Winter "}, "Wild celery": {"water": "the soil around your Wild celery plants consistently moist, but make sure that it drains well to avoid root rot. These plants are thirsty and do not do well in dry conditions.", "fertilization": "regular feeding of balanced fertilizer helps wild celery plants to thrive. Apply when planting, and repeat at least once monthly during the growing season.", "soil": "Sandy loam, Slightly acidic, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "to 10", "plantingTime": " Late spring, Early summer "}, "Maize": {"water": "great way to keep the soil around Maize moist is to apply a layer of mulch just after planting. Then water the plants regularly using a drip method at the base of the plant to get to the roots. Around 1 inch or 1.5 inch of water per week is a good benchmark but the best system is to water the plant as soon as the top layer of soil dries out.", "fertilization": "likes slightly acidic soil, so it is a good idea to test your soil pH to establish what chemicals to apply to achieve the correct balance. After this, all that is needed is to add a balanced slow-release N-P-K fertilizer (a ratio of 10-10-10 is ideal) before seeding. Fertilize again when the plant is 30 cm tall, but make sure the fertilizer doesn't touch the plant.", "soil": "Clay, Acidic, Neutral, Slightly alkaline, Moderately alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Early spring "}, "Spinach": {"water": "prevent Spinach from going to seed, do not let the soil dry out. Keep the ground evenly moist, watering when it begins to dry out. Water close to the plant鈥檚 base to keep the moisture from splashing on the leaves.", "fertilization": "manure or compost along with an all-purpose granulated fertilizer to the garden bed before planting spinach encourages healthy roots and growth. A vegetable fertilizer can also be applied at planting time, and once again during the growing season.", "soil": "Sand, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Spring, Summer "}, "Okra": {"water": "likes a moist environment, and high moisture levels are particularly important when flowering and when the pod is developing. Water the plant before the soil dries out and during lengthy dry stretches. When the top 1 inch of soil dries out, give your plant a good watering. Drip irrigation and soaker hoses are recommended to keep the soil moist.", "fertilization": "okra is not necessary, but will boost the amount of fruits the plant produces. A balanced fertilizer should be used before planting and then again when the plants are around 15 cm to 20 cm in height. Feed during the growing season every 3-4 weeks and even more frequently for okra growing in pots.", "soil": "Clay, Sand, Chalky, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     8 to 10    ", "plantingTime": " Spring "}, "Garlic": {"water": "to its deep taproots, Garlic doesn't usually need loads of water to thrive, but consistent moisture will certainly help them grow bigger. In the spring and summer, when the top 1 inch of soil is dry, give it a good drink. Reduce watering once the foliage starts to turn yellow, as they will be mostly mature and might get diseased.", "fertilization": "has some heavy and precise fertilizer needs if you want to optimize its thriving. Right before planting (in either fall or early spring), mix heavy compost or all-purpose fertilizer directly into the soil. Then, in spring, start fertilizing your garlic every 3-4 weeks with a high-nitrogen fertilizer. Once the bulbs begin to swell, stop feeding it high-nitrogen fertilizer and give it a balanced one instead until they're ready to pull out.", "soil": "Chalky, Acidic, Neutral, Alkaline", "hardinessZones": "     5 to 11    ", "plantingTime": " All year around "}, "Pea": {"water": "Garden pea does not need a large amount of water. Instead, the key, especially during the spring and summer growing season, is to keep the surrounding soil evenly moist. Check the soil, especially in hot weather, and water it whenever the surface becomes dry. The best time of day to water the plant is in the morning to prevent bud damage and leaf scorching.", "fertilization": "pea has quite specific nutrient needs, so testing the soil is the best way to establish how to feed it. Nitrogen- and potassium-rich, phosphorous-poor soil is best. Apply good manure or mulch when planting. The pea is sensitive to excess phosphorous so using a low-phosphorous fertilizer at the start of the growing season in a ratio such as 25-3-12 is advisable.", "soil": "Loam, Neutral, Slightly alkaline", "sunlight": "sun, Partial sun", "plantingTime": " Spring, Summer "}, "Crookneck squash": {"water": "water needs, watering when the top 3 cm of soil has dried out.", "fertilization": "the best fruits and vegetables, any type of balanced fruit and vegetable fertilizer will do the trick for crookneck squash. Adding fertilizer with slightly higher levels of nitrogen will encourage peak leaf growth instead of flowers and fruits. Use fertilizer before planting your crookneck squash and then every month after throughout the spring and summer.", "soil": "Sand, Clay", "sunlight": "sun, Partial sun", "hardinessZones": "     5 to 11    "}, "Garden asparagus": {"water": "asparagus does best in moist soils that have good drainage. The soil should be evenly moist, but not sodden. Growing in excessively wet soils can result in disease. It should be watered thoroughly during its first growth season and regularly thereafter to mantain a moist growing environment.", "fertilization": "asparagus does not need to be fertilized. Rather, it should be treated with compost or manure during its growth season. It can also be treated with garden soil and a balanced 10-10-10 fertilizer in fall or spring.", "soil": "Loam, Clay, Chalky, Sandy loam, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 10", "plantingTime": " Mid spring, Late spring "}, "Globe artichoke": {"water": "water needs, watering when the top 3 cm of soil has dried out.", "fertilization": "once every 2-3 months during the growing season.", "soil": "Sand, Sandy loam, Acidic, Neutral, Alkaline", "sunlight": "sun", "hardinessZones": "to 9"}, "Lettuce": {"fertilization": "lettuce, you can add fish emulsion fertilizer at half-strength or blood meal to the soil several weeks before you sow. Three weeks after planting, and when growing, apply balanced or high nitrogen fertilizer to lettuce. Follow instructions for your specific fertilizer.", "sunlight": "sun, Partial sun", "hardinessZones": "to 7"}, "Garden carrot": {"fertilization": "order to produce the best harvest, you should fertilize your carrot once during the year, either half a month before planting or when their foliage reaches a few inches above the ground. An all-purpose granular fertilizer is a good choice. Make sure your fertilizer has lower nitrogen levels in order to help the edible root develop more than the foliage.", "soil": "Neutral, Alkaline", "sunlight": "sun", "hardinessZones": "to 10"}, "Tomato": {"water": "tomato should be watered very often in the active growing season during the late spring and summer months. Depending on how much sunlight and heat they receive, it is advisible to water these plants at most daily or at least twice weekly. The soil should be kept consistently moist without becoming wet or soggy.", "fertilization": "tomato should be fertilized regularly during the active growth season in the summer. There are many commercially available fertilizers formulated especially for tomato plants, and these may be applied every two weeks to monthly during the summer. A fertilizer that is low in nitrogen content and higher in phosphorous is ideal.", "soil": "Loam, Clay, Acidic, Neutral", "sunlight": " Full sun ", "hardinessZones": "     2 to 10    ", "plantingTime": " Spring, Winter "}, "Ginger": {"soil": "Loam, Clay, Chalky, Acidic, Neutral", "sunlight": "sun, Full sun", "hardinessZones": "to 11", "plantingTime": "spring", "water": " Every week "}, "Common coconut palm": {"water": "coconut palm thrives in moist and well-drained soils. Its nuts have been known to withstand seawater and it can also withstand drought. However, exposure to drought will result in a lower yield of coconuts. Therefore, gardeners should keep Common coconut palm consistently moist by watering regularly to maintain moisture.", "fertilization": "coconut palm does well when fertilized with a 2-1-1 ratio of slow and fast releasing nitrogen fertilizer. It can be fertilized bi-yearly in winter and spring. In addition, gardeners may choose to treat common coconut palm with manure to offer additional nutrition.", "soil": "Loam, Clay, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 12", "plantingTime": " Spring, Fall "}, "Peach": {"water": "requires well-drained soil and does best when watered infrequently, but thoroughly. Water your tree when the top few inches of soil feel significantly dry. If your tree doesn't receive the needed amount of water through rainfall, water the plant thoroughly, particularly during prolonged periods of drought.", "fertilization": "peach trees should be fertilized once in early spring and again in late spring. Young plants should be fertilized more often. Mature plants mostly need nitrogen and potassium, while young plants require more phosphorus. However, be sure to test your soil and check the tree for visual symptoms of nutrient deficiency before applying any extra fertilizer.", "soil": "Sand, Loam, Acidic, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "     5 to 9    "}, "Mango tree": {"water": "Mango tree is reasonably drought tolerant, extended dry conditions can impair its yield. Therefore, it is preferable to keep the tree well-watered. A good guideline is to water the tree every time the top half-finger depth of soil dries out.", "fertilization": "tree benefits from adding a nitrogen-rich, low-phosphorus fertilizer at regular intervals up to three times a year. Use around 1 pound of slow-release fertilizer for each year of growth. Additional quick-release fertilizer can be added just before flowering to increase flower and fruit yield.", "soil": "Loam, Clay", "sunlight": "sun, Partial sun", "hardinessZones": "     10 to 12    ", "plantingTime": " Mid spring, Late spring "}, "Sweet cherry": {"water": "cherry is a relatively drought-tolerant tree, though it performs best when provided with adequate moisture during hot spells. Mulch the area around the tree to help retain moisture. Although Sweet cherry likes regular watering, it doesn't tolerate soggy soil.", "fertilization": "if the soil is healthy and nutrient-rich, sweet cherry won't need any fertilizer. However, keep an eye on your plant and if you notice stunted growth, apply a low-nitrogen fertilizer. Don't overfertilize as this can only harm the plant.", "soil": "Clay, Sand, Chalky, Sandy loam, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     5 to 9    ", "plantingTime": " Spring, Fall, Winter "}, "Red raspberry": {"water": "raspberry needs well-drained soil as it's unable to withstand \"wet feet,\" However, these plants do need a great deal of water, especially during the fruiting period. Regular watering is essential for young plants, as well. During hot spells, Red raspberry should be watered daily. For optimal results, a drip irrigation system is the best option.", "fertilization": "your red raspberry in spring to give the bush a good kick. A general-purpose, slow-release fertilizer, organic plant food, manure, or garden compost will work just fine, though the raspberries particularly benefit from a fertilizer rich in nitrogen. Upon planting, balanced fertilizer is a better option, but after planting nitrogen-rich fertilizer is advised.", "soil": "Loam, Clay, Chalky, Sandy loam, Acidic, Neutral, Slightly alkaline, Moderately alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     4 to 8    ", "plantingTime": " Early spring, Late fall, Early winter, Mid winter "}, "Avocado": {"water": "requires a moderate and regular supply of water, but it doesn't tolerate waterlogged soil. When the top layer of soil seems dry, water with small amounts of water and do not overwater the plant. Wilting leaves may be a sign of both too much and too little water.", "fertilization": "plants don't have any particular feeding needs unless the soil lacks important nutrients. If you do want to add a fertilizer to your substrate, choose one formulated specifically for avocado or citrus plants.", "soil": "Sand, Clay, Acidic, Neutral, Slightly alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 12", "plantingTime": " Spring "}, "Lemon": {"water": "is drought-tolerant, but consistent moisture will ensure the healthiest plant. New plants need a regular watering schedule until they become established. Mature plants prefer to be deeply and thoroughly watered, rather than lightly and frequently. When the top few inches of soil are dry, water the plant. In hot summer, your plant may require more water than usual.", "fertilization": "is a heavy feeder that benefits from nitrogen. During its growth period, feed your plant every 2 weeks with a liquid, organic fertilizer. Occasionally, you can also use a fertilizer designed specifically for citrus plants. Avoid feeding your lemon during the winter. Potted and young plants should be fertilized more often.", "soil": "Sand, Clay, Acidic, Neutral", "sunlight": "sun", "hardinessZones": "     9 to 11    ", "plantingTime": " Spring, Fall "}, "Common fig": {"water": "fig is a drought-tolerant tree that can withstand prolonged periods without rainfall; however, for optimal yield, it's advised to keep your tree hydrated. Regular moisture during fruiting time will ensure large and high-quality fruit. Common fig doesn't tolerate soggy soil, so allow it to dry out a little between waterings.", "fertilization": "fig usually doesn't have any specific feeding requirements unless the soil lacks important nutrients. Container plants do, however, usually require occasional fertilizing. Feed your common fig with balanced, slow-release chemical fertilizer in spring. Feed again in the fall.", "soil": "Loam, Clay, Chalky, Acidic, Neutral, Alkaline", "sunlight": " Full sun ", "hardinessZones": "     5 to 12    ", "plantingTime": " Spring, Fall "}, "Date palm": {"water": "Allow the soil to dry completely between watering.", "fertilization": "the best growth results, apply fertilizer to the date palm a few times throughout the year. Just before growth begins, spread compost or organic fertilizer around the tree and water the area thoroughly. For the rest of the growing season, you can apply a water-soluble, nitrogen-low fertilizer alongside regular watering. Feed it at least twice during the growing season.", "soil": "Sand, Clay, Chalky, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     9 to 13    ", "plantingTime": " Late spring, Early summer "}, "Mandarin orange": {"water": "at the leaves to know when to water Mandarin orange. If the leaves are pointing upwards, it is time to water the plant, but if they droop down, it is being over-watered. The plant requires frequent watering in the growing season and should be watered before the topsoil dries. Monthly watering is a good guideline for the winter months.", "fertilization": "orange needs frequent fertilization, especially when grown in a container. A citrus-friendly fertilizer with plenty of lye and nitrogen is the best type to use. Aim to feed it around every two weeks during the growing season and half as often in winter.", "soil": "Clay, Sand, Chalky, Sandy loam, Acidic, Neutral, Alkaline", "sunlight": " Full sun ", "hardinessZones": "     9 to 11    ", "plantingTime": " Spring, Fall "}, "European plum": {"water": "plum requires regular, deep waterings when first becoming established. Keep soil moist, but do not let it become waterlogged. As the tree gets older and deepens its roots, less supplemental watering will be needed; some extra water will always be needed during particularly hot or dry summer stretches, however.", "fertilization": "your european plum is already in rich soil, it may not need any fertilizer at all. If your soil is on the poorer side, though, or if you're noticing that fruit or leaf growth is lacking, amending with fertilizer can be helpful. If growth is lacking all around, a balanced (10-10-10) fertilizer, either liquid or powder, can be broadcast applied to an area around the base of the tree in late spring. If leaves and stems are fine but fruits are lacking, you may want to use a low-nitrogen (5-10-10) formula instead.", "soil": "Chalky, Acidic, Neutral", "sunlight": "sun, Partial sun", "plantingTime": " Spring, Fall, Winter "}, "Pomegranate": {"water": "Pomegranate is relatively drought-tolerant, it still needs regular moisture in order to produce fruit. Regular watering is crucial for young plants that haven't developed a strong root system yet. Pomegranate prefers deep watering that allows the entire root system to get soaked.", "fertilization": "its first year, mulch your pomegranate with manure or garden compost. Starting the second year, apply a balanced granular fertilizer in spring, especially if your soil lacks vital nutrients. Avoid applying the fertilizer directly to the trunk.", "soil": "Loam, Chalky, Clay, Alkaline", "sunlight": " Full sun ", "hardinessZones": "     5 to 11    ", "plantingTime": " Spring, Fall "}, "Paradise apple": {"water": "many other apple trees, Paradise apple is a fairly thirsty plant. When first getting established, they should be watered weekly. Adding a thin layer of mulch around the base of the tree can help their soil maintain its moisture. As they mature, you should switch to less frequent but deeper waterings. Soaking soil down half a foot or more encourages the roots to dig deeper, helping them become more drought tolerant.", "fertilization": "apple can be fertilized annually, in the spring. These plants prefer nitrogen-heavy fertilizers mixes (e.g., 10-6-4); liquid, powder, or granulated fertilizers will all do, so long as they are scattered evenly underneath the tree's canopy. They also prefer slightly acidic soil, so if your soil is neutral or basic, you may want to use a mix with some extra sulfur.", "soil": "Loam, Clay, Slightly acidic, Neutral, Slightly alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     3 to 10    ", "plantingTime": " Spring, Fall "}, "Cantaloupe": {"water": "should be watered regularly once the plant is established. When watering, the first six inches of soil should be soaked with water. During planting, the soil should be regularly kept moist to help germination and root establishment. Uneven watering practices can cause issues with the fruit of this plant.", "fertilization": "should be fertilized after soil tests have been performed in order to specifically formulate the fertilizer to be applied. Fertilizer that is too rich in nitrogen can reduce the fruit output and increase vine growth. Fertilizer may be applied every two weeks or monthly.", "soil": "Clay, Sand, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "     5 to 11    "}, "Wine grape": {"water": "lots of water-filled fruits (grapes), it's intuitive that Wine grape would be a very thirsty plant. They should be given a deep watering at least once per week, or more if you're experiencing a period of high heat or very dry weather. Make sure they are planted in soil that provides plenty of drainage, though 鈥?they susceptible root rot and other diseases when they sit in waterlogged soil for too long.", "fertilization": "grape does best in rich soil. If your soil is lacking in nutrients, try adding some manure to the area around your plantings before the growing season starts (usually, late winter). A balanced (e.g., 10-10-10), slow release fertilizer mix is also appropriate, whether or not they're already growing in rich soil. This can be applied in late spring, just make sure to scatter around the base of your plants, not directly on their stems.", "soil": "Clay, Sand, Chalky, Sandy loam, Acidic", "sunlight": " Full sun ", "plantingTime": " Spring, Fall, Winter "}, "Blackthorn": {"water": "requires minimal water once established. For the first two years, water regularly per the standard rule of 2 to 3 gallons of water for one inch of the trunk. In later years, you only need to water them when rainfall has been insufficient and the surrounding soil has become dried out.", "fertilization": "requires fertilizing only if the soil is deficient in nutrients. Do test the soil before choosing a fertilizer. The soil can be amended with compost during planting, or a commercial fertilizer can be applied later. A shrub fertilizer can be a good choice. Test the quality again periodically to determine if treatments need to be repeated.", "soil": "Clay, Loam, Chalky, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 9", "plantingTime": " Spring, Fall "}, "Pineapple": {"water": "needs plenty of water during its spring and summer growing season. The surrounding soil needs to be kept moist so always water before it dries out. The plant dislikes calcium so don't use hard water and make sure that the water is at room temperature. During winter dormancy, allow the soil to dry a little before watering.", "fertilization": "most important nutrient for pineapple is nitrogen so it is important to use a fertilizer with a 6-10% nitrogen content. Use a dry fertilizer with an NPK ratio somewhere between 6-6-6 and 10-10-10. Plants should be fertilized every couple of months, increasing the quantities from 1 ounce to a maximum of 24 ounce as the plant matures.", "soil": "Acidic, Neutral", "sunlight": " Full sun ", "hardinessZones": "     9 to 11    ", "plantingTime": " Spring "}, "Papaya": {"water": "trees have big leaves that lose a lot of water, so expect your papaya to be thirstier than the average tree. Keep the soil around an establishing tree consistently moist. Mature trees should be watered whenever the top 1 inch of soil beneath them dries out. Make sure that the soil drains well.", "fertilization": "planting or transplanting your papaya, amend the soil first with a good-quality compost, then put extra phosphorous into the bottom of the hole you dig for planting. After three months, feed your tree monthly with a good 14-14-14 fertilizer, skipping fertilizer altogether in winter. A thick layer of leaf or bark mulch will help both nourish your tree and let its soil retain more moisture.", "soil": "Slightly acidic, Neutral", "hardinessZones": "     10 to 12    ", "plantingTime": " Spring, Summer "}, "Common passionfruit": {"water": "passionfruit plants will need plenty of consistent moisture to grow lots of lovely blossoms. During the growing season, water your Common passionfruit plant evenly before the surface of the soil gets completely dry. Do not give it much water in the winter to avoid soggy roots.", "fertilization": "passionfruit is a greedy feeder, so your plant will need to be fertilized at least 4 times a year or even once a month, depending on the quality of the soil. Starting in the early spring and every 4-6 weeks after until fall, apply a 10-5-20 ratio slow-release fertilizer to the soil around your plant.", "soil": "Loam, Clay, Chalky, Acidic, Neutral", "sunlight": " Full sun ", "plantingTime": " Spring, Summer, Fall "}, "Common pear": {"water": "pear grows in well-drained mesic loams. It is best to establish routine watering. Deeply water the common pear once a weak to support its growth, but do not overwater the plants.", "fertilization": "pear can be treated with a 6-6-6 or 8-8-8 fertilizer in winter and summer. Pears can benefit from fertilizers rich with magnesium, iron, and zinc. It should not be overfertilized as that can result in the plant's suceptibility to fire blight.", "soil": "Clay, Sand, Chalky, Neutral", "sunlight": "sun, Partial sun", "hardinessZones": "     4 to 9    ", "plantingTime": " Spring, Fall "}, "Dragon fruit": {"water": "fruit should be planted in well-draining soil and watered regularly so the surrounding soil does not dry out completely in between waterings. In the cooler months, intermittent drenching of the soil is sufficient. It is drought tolerant and susceptible to root rot, so it is better to underwater this species than risk overwatering it.", "fertilization": "fruit should be fertilized with a well-balanced commercial fertilizer suitable for houseplants or cacti. It should be fertilized every four waterings during the active growing season. During the dormant winter months, this can be reduced to fertilization every six waterings.", "soil": "Loam, Chalky, Clay, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     10 to 12    ", "plantingTime": " Early spring "}, "Japanese persimmon": {"water": "new growth begins, Japanese persimmon requires plenty of water, particularly if it's dry, so make sure to water deeply and regularly through spring and early summer. If the top 1 inch - 2 inches of soil is dry, go ahead and water your plant. Trickle irrigation can be used to encourage a deep root system.", "fertilization": "persimmon doesn't require fertilization when it is young but as it ages, you can occasionally supplement it with fertilizer. Manure and blood and bone can be spread around it in the spring or, alternatively, use a NPK fertilizer on the ground under the canopy of the tree.", "soil": "Sand, Clay, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "     6 to 11    ", "plantingTime": " Spring, Fall "}, "Garden strawberry": {"water": "the active growing season, Garden strawberry needs plenty of water, particularly during the fruiting season. Strawberries like moist, but not soggy soil. The plants should be watered whenever the soil starts drying out, but make sure that the soil doesn't dry out too much. Water the plants in the morning and be sure not to overwater them. A drip system is a good option to keep the plants well-hydrated.", "fertilization": "garden strawberry once in spring with a fertilizer specifically formulated for berries. You can also add an organic fertilizer in the spring and feed again in midseason using a balanced fertilizer. Well-rotted manure, garden compost, fish, feather, or bone meal are good options. Try not to overfertilize.", "sunlight": "sun, Partial sun", "hardinessZones": "     4 to 8    ", "plantingTime": " Fall, Spring "}, "Highbush blueberry": {"water": "blueberry is a relatively low-maintenance plant, only needing water when the top of the soil starts to feel dry. It requires even moisture without overwatering, as it is sensitive to sogginess. If growing in a pot, Highbush blueberry will likely require more consistent watering, as it dries out quicker.", "fertilization": "blueberry bushes have sensitve fertilizing needs. For the best growth and fruit production, your plant will need a high-acid, high-nitrogen fertilizer that is slowly released over several months, applied once in early spring and again 6 weeks later. Be careful, too much fertilizer will damage the roots.", "soil": "Clay, Acidic", "sunlight": " Full sun ", "hardinessZones": "     5 to 9    ", "plantingTime": " Spring, Fall "}, "Cape gooseberry": {"water": "water needs,watering when the top 3 cm of soil has dried out.", "fertilization": "once in spring.", "soil": "Loam, Clay, Acidic", "sunlight": "sun, Partial sun", "hardinessZones": "     10 to 12    "}, "Commom sugarcane": {"water": "water needs,watering when the top 3 cm of soil has dried out.", "fertilization": "once every 2-3 months during the growing season.", "soil": "Loam, Clay", "sunlight": "sun, Partial sun", "hardinessZones": "     9 to 12    ", "plantingTime": " Late summer, Early fall "}, "Banana": {"sunlight": "sun, Partial sun", "hardinessZones": "to 12"}, "Common guava": {"water": "initially planted, Guava should be watered regularly until established. After establishment, it may be watered deeply and allowed to dry thoroughly before watering again in monthly intervals. Guava prefers well-drained soils but will grow in sodden soils that are subject to flooding seasonally.", "fertilization": "guava can be fertilized once monthly from summer to fall. Once established, it can be fertilized once from spring to fall. It prefers fertilizers with mixes that contain nitrogen, phosphoric acid, potash, and magnesium. Guava can also be sprayed with a nutritional spray four times a year.", "soil": "Acidic, Neutral, Slightly alkaline", "sunlight": "sun", "hardinessZones": "     9 to 11    ", "plantingTime": " Spring, Fall "}, "Kiwi": {"water": "water needs, watering when the top 3 cm of soil has dried out.", "fertilization": "once in spring.", "soil": "Sand, Acidic, Neutral, Alkaline", "sunlight": "sun, Partial sun", "hardinessZones": "to 11", "plantingTime": " Spring "}}